cannox227/Step-Motor-Test-Bench/Firmware/FW_STM32H723ZG/STB-master/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "tim.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin                          GPIO_PIN_13
#define B1_GPIO_Port                    GPIOC
#define LED1_Pin                        GPIO_PIN_7
#define LED1_GPIO_Port                  GPIOF
#define LED2_Pin                        GPIO_PIN_9
#define LED2_GPIO_Port                  GPIOF
#define MCO_Pin                         GPIO_PIN_0
#define MCO_GPIO_Port                   GPIOH
#define RMII_MDC_Pin                    GPIO_PIN_1
#define RMII_MDC_GPIO_Port              GPIOC
#define VOLTAGE_STEPPER_ADC_Pin         GPIO_PIN_3
#define VOLTAGE_STEPPER_ADC_GPIO_Port   GPIOC
#define RMII_REF_CLK_Pin                GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port          GPIOA
#define RMII_MDIO_Pin                   GPIO_PIN_2
#define RMII_MDIO_GPIO_Port             GPIOA
#define TORQUE_ADC_Pin                  GPIO_PIN_3
#define TORQUE_ADC_GPIO_Port            GPIOA
#define CURRENT_ADC_Pin                 GPIO_PIN_5
#define CURRENT_ADC_GPIO_Port           GPIOA
#define RMII_CRS_DV_Pin                 GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port           GPIOA
#define RMII_RXD0_Pin                   GPIO_PIN_4
#define RMII_RXD0_GPIO_Port             GPIOC
#define RMII_RXD1_Pin                   GPIO_PIN_5
#define RMII_RXD1_GPIO_Port             GPIOC
#define LED_GREEN_Pin                   GPIO_PIN_0
#define LED_GREEN_GPIO_Port             GPIOB
#define RMII_TXD1_Pin                   GPIO_PIN_13
#define RMII_TXD1_GPIO_Port             GPIOB
#define LED_RED_Pin                     GPIO_PIN_14
#define LED_RED_GPIO_Port               GPIOB
#define STLK_VCP_RX_Pin                 GPIO_PIN_8
#define STLK_VCP_RX_GPIO_Port           GPIOD
#define STLK_VCP_TX_Pin                 GPIO_PIN_9
#define STLK_VCP_TX_GPIO_Port           GPIOD
#define USB_FS_OVCR_Pin                 GPIO_PIN_7
#define USB_FS_OVCR_GPIO_Port           GPIOG
#define PWM_BRAKE_Pin                   GPIO_PIN_8
#define PWM_BRAKE_GPIO_Port             GPIOC
#define ENABLE_STEPPER_SUPPLY_Pin       GPIO_PIN_9
#define ENABLE_STEPPER_SUPPLY_GPIO_Port GPIOC
#define USB_FS_VBUS_Pin                 GPIO_PIN_9
#define USB_FS_VBUS_GPIO_Port           GPIOA
#define USB_FS_ID_Pin                   GPIO_PIN_10
#define USB_FS_ID_GPIO_Port             GPIOA
#define USB_FS_DM_Pin                   GPIO_PIN_11
#define USB_FS_DM_GPIO_Port             GPIOA
#define USB_FS_DP_Pin                   GPIO_PIN_12
#define USB_FS_DP_GPIO_Port             GPIOA
#define SWDIO_Pin                       GPIO_PIN_13
#define SWDIO_GPIO_Port                 GPIOA
#define SWCLK_Pin                       GPIO_PIN_14
#define SWCLK_GPIO_Port                 GPIOA
#define RMII_TX_EN_Pin                  GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port            GPIOG
#define RMII_TXD0_Pin                   GPIO_PIN_13
#define RMII_TXD0_GPIO_Port             GPIOG
#define SWO_Pin                         GPIO_PIN_3
#define SWO_GPIO_Port                   GPIOB
#define LED_YELLOW_Pin                  GPIO_PIN_1
#define LED_YELLOW_GPIO_Port            GPIOE
/* USER CODE BEGIN Private defines */

#define UART_USB                huart3
#define UART_SLAVE              huart1
#define TIMER_BRAKE_PWM         htim3
#define TIMER_BRAKE_PWM_CHANNEL TIM_CHANNEL_3

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
